[{
        "productName": "Apple iPhone 14 Pro",
        "productDescription": "The Apple iPhone 14 Pro comes with an innovative design and top-tier features that make it one of the most sought-after smartphones on the market. It features a stunning 6.1-inch Super Retina XDR display, providing vibrant colors and deep blacks, making it perfect for both media consumption and productivity tasks. Powered by the A16 Bionic chip, this phone ensures seamless performance, whether you're gaming, multitasking, or using AR applications. The camera system has been upgraded with a 48MP main sensor that allows you to capture professional-quality photos and videos. Night mode and Deep Fusion technology enhance low-light photography, while the LiDAR scanner improves augmented reality experiences. Battery life is excellent, offering up to 22 hours of talk time. The phone also supports MagSafe accessories for easier attachment and faster wireless charging. With 5G capabilities, the iPhone 14 Pro ensures that you are future-proofed for faster connectivity. This model is not just a phone; it's a statement of luxury and innovation.",
        "productCategory": "Smartphone",
        "productPrice": 1199,
        "brandName": "Apple",
        "productStoreDate": "2024-01-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Apple%20iPhone%2014%20Pro.webp",
        "productReview": 4.8
    },
    {
        "productName": "Samsung Galaxy S23 Ultra",
        "productDescription": "The Samsung Galaxy S23 Ultra is a powerhouse of a smartphone, designed for those who demand the very best in mobile technology. It boasts a massive 6.8-inch Dynamic AMOLED 2X display with a 120Hz refresh rate, providing ultra-smooth scrolling and gaming experiences. The device is equipped with the latest Snapdragon 8 Gen 2 processor, ensuring lightning-fast performance and exceptional efficiency. The camera system is nothing short of spectacular, featuring a 200MP primary sensor, a 12MP ultra-wide lens, and dual telephoto lenses with up to 100x Space Zoom. Whether you're shooting in daylight or at night, the S23 Ultra captures every detail with precision. The phone also supports S Pen functionality, making it a perfect tool for note-taking and creative tasks. Battery life is robust, with a 5000mAh battery that easily lasts through a full day of heavy use. Additionally, the Galaxy S23 Ultra comes with IP68 water and dust resistance, ensuring durability in various environments. With 5G connectivity and advanced security features, this phone is ready to meet all your professional and personal needs.",
        "productCategory": "Smartphone",
        "productPrice": 1399,
        "brandName": "Samsung",
        "productStoreDate": "2024-02-15",
        "productImg": "https://img.geniusdevsolutions.com/image/Samsung%20Galaxy%20S23%20Ultra.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Sony WH-1000XM5",
        "productDescription": "The Sony WH-1000XM5 is a premium pair of noise-cancelling headphones that deliver unparalleled sound quality and comfort. These headphones are designed with industry-leading noise cancellation technology that blocks out ambient noise, allowing you to fully immerse yourself in your music, movies, or calls. The WH-1000XM5 features custom 40mm drivers that produce rich, detailed sound with deep bass and crisp highs. With adaptive sound control, the headphones automatically adjust the sound settings based on your activity and environment. The ear cups are made of soft, plush material, providing hours of comfortable listening without discomfort. The battery life is exceptional, offering up to 30 hours of playback on a single charge, and with quick charging, you can get 5 hours of playback with just 10 minutes of charging. The headphones also come with touch controls for easy management of your music and calls, as well as support for voice assistants like Google Assistant and Alexa. Whether you're a frequent traveler, a remote worker, or just a music enthusiast, the Sony WH-1000XM5 is the perfect companion for an immersive audio experience.",
        "productCategory": "Headphones",
        "productPrice": 399,
        "brandName": "Sony",
        "productStoreDate": "2024-03-12",
        "productImg": "https://img.geniusdevsolutions.com/image/Sony%20WH-1000XM5.jpg",
        "productReview": 4.7
    },
    {
        "productName": "Dell XPS 15",
        "productDescription": "The Dell XPS 15 is a high-performance laptop designed for creative professionals and power users who demand the best from their devices. Featuring a stunning 15.6-inch 4K UHD+ display with InfinityEdge technology, the XPS 15 offers a virtually borderless viewing experience with exceptional clarity and color accuracy. Powered by the latest Intel Core i9 processor and NVIDIA GeForce RTX 4060 graphics, this laptop can handle intensive tasks such as video editing, 3D rendering, and gaming with ease. The XPS 15 also comes with up to 64GB of RAM and 2TB of SSD storage, ensuring that you have ample space and speed for all your files and applications. The laptop's build quality is second to none, with a sleek aluminum chassis and carbon fiber palm rest that provide both durability and a premium feel. The keyboard is backlit and offers a comfortable typing experience, while the large precision trackpad makes navigation smooth and precise. Battery life is impressive, allowing you to work or play for extended periods without needing to recharge. With Thunderbolt 4 ports, Wi-Fi 6E, and an advanced cooling system, the Dell XPS 15 is equipped to meet the needs of the most demanding users.",
        "productCategory": "Laptop",
        "productPrice": 2499,
        "brandName": "Dell",
        "productStoreDate": "2024-04-05",
        "productImg": "https://img.geniusdevsolutions.com/image/Dell%20XPS%2015.webp",
        "productReview": 4.8
    },
    {
        "productName": "Canon EOS R5",
        "productDescription": "The Canon EOS R5 is a revolutionary mirrorless camera that redefines what is possible in the world of photography and videography. Designed for professional photographers and videographers, the EOS R5 features a 45MP full-frame CMOS sensor that delivers stunning image quality with incredible detail and dynamic range. The camera is capable of shooting 8K video at 30fps, making it one of the first cameras to offer such high-resolution video recording. With Dual Pixel CMOS AF II, the EOS R5 provides fast and accurate autofocus, ensuring that you never miss a moment. The camera also features in-body image stabilization, which provides up to 8 stops of shake correction, allowing for sharp handheld shots even in low light conditions. The EOS R5 is built to withstand the rigors of professional use, with a durable magnesium alloy body that is both dust and weather-resistant. The camera's ergonomic design makes it comfortable to hold and easy to operate, even during long shooting sessions. With a 5.76-million-dot electronic viewfinder and a vari-angle touchscreen LCD, composing and reviewing your shots is a pleasure. Whether you're capturing landscapes, portraits, or fast-moving action, the Canon EOS R5 delivers exceptional performance and image quality.",
        "productCategory": "Camera",
        "productPrice": 3899,
        "brandName": "Canon",
        "productStoreDate": "2024-05-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Canon%20EOS%20R5.webp",
        "productReview": 4.9
    },
    {
        "productName": "Nike Air Zoom Pegasus 39",
        "productDescription": "The Nike Air Zoom Pegasus 39 is the latest iteration of Nike's iconic running shoe, offering a perfect blend of comfort, performance, and style. Designed for runners of all levels, the Pegasus 39 features a lightweight and breathable mesh upper that provides a secure and comfortable fit, while allowing your feet to stay cool and dry during long runs. The shoe is equipped with Nike's Zoom Air units in the forefoot and heel, which provide responsive cushioning and a smooth transition with every stride. The midsole is made from Nike React foam, offering a perfect balance of support and flexibility, allowing you to maintain your natural stride. The outsole is made from durable rubber with a waffle pattern that provides excellent traction on a variety of surfaces, ensuring that you stay stable and secure during your runs. The Pegasus 39 also features a padded collar and tongue for added comfort, and the lacing system ensures a snug fit that prevents your foot from slipping inside the shoe. Whether you're training for a marathon or just going for a casual jog, the Nike Air Zoom Pegasus 39 is designed to help you reach your goals with confidence.",
        "productCategory": "Running Shoes",
        "productPrice": 129,
        "brandName": "Nike",
        "productStoreDate": "2024-06-01",
        "productImg": "https://img.geniusdevsolutions.com/image/Nike%20Air%20Zoom%20Pegasus%2039.jpeg",
        "productReview": 4.6
    },
    {
        "productName": "Dyson V11 Absolute",
        "productDescription": "The Dyson V11 Absolute is a cordless vacuum cleaner that offers powerful suction and advanced features, making it one of the best cleaning tools on the market. The V11 Absolute is designed for versatility and ease of use, with a lightweight and ergonomic design that allows you to clean every corner of your home without any hassle. It is powered by the Dyson digital motor V11, which provides strong suction for deep cleaning on both carpets and hard floors. The vacuum comes with an LCD screen that displays real-time information, such as remaining battery life and current cleaning mode, so you can easily monitor and optimize your cleaning sessions. The V11 Absolute offers three cleaning modes—Eco, Auto, and Boost—allowing you to adjust the power and suction based on the task at hand. The vacuum also features a high-torque cleaner head that automatically adjusts to different floor types, ensuring optimal performance on all surfaces. The V11 Absolute's battery provides up to 60 minutes of fade-free power, and the vacuum comes with a convenient wall-mounted docking station for easy storage and charging. With its advanced filtration system, the Dyson V11 Absolute captures 99.97% of particles as small as 0.3 microns, ensuring a cleaner and healthier home.",
        "productCategory": "Vacuum Cleaner",
        "productPrice": 699,
        "brandName": "Dyson",
        "productStoreDate": "2024-07-20",
        "productImg": "https://img.geniusdevsolutions.com/image/Dyson%20V11%20Absolute.jpg",
        "productReview": 4.7
    },
    {
        "productName": "Bose SoundLink Revolve+ II",
        "productDescription": "The Bose SoundLink Revolve+ II is a portable Bluetooth speaker that delivers 360-degree sound with deep, rich bass and clear, detailed highs. Designed for those who love to take their music on the go, the Revolve+ II features a sleek and durable design with an aluminum body that is water and dust-resistant, making it perfect for outdoor adventures. The speaker offers up to 17 hours of battery life, allowing you to enjoy your favorite tunes all day long without needing to recharge. The Revolve+ II also comes with a built-in handle, making it easy to carry wherever you go. The speaker is equipped with a dual-passive radiator system and an omnidirectional acoustic deflector, ensuring that your music sounds great from every angle. With Bluetooth connectivity, you can easily pair the speaker with your smartphone, tablet, or other devices, and the speaker also supports voice prompts for easy setup. The Revolve+ II can be paired with another Bose speaker for stereo or party mode, providing an even more immersive listening experience. Whether you're at home, in the park, or at a party, the Bose SoundLink Revolve+ II is the perfect companion for high-quality, portable audio.",
        "productCategory": "Bluetooth Speaker",
        "productPrice": 329,
        "brandName": "Bose",
        "productStoreDate": "2024-08-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Bose%20SoundLink%20Revolve.jpg",
        "productReview": 4.8
    },
    {
        "productName": "Apple MacBook Pro 16-inch",
        "productDescription": "The Apple MacBook Pro 16-inch is a powerhouse of a laptop, designed for professionals who need the best performance and reliability in their computing devices. It features a stunning 16-inch Retina display with True Tone technology, providing incredibly sharp and vibrant visuals that are perfect for photo and video editing, graphic design, and other creative work. The MacBook Pro is powered by the Apple M2 Max chip, which delivers unparalleled processing power and efficiency, allowing you to handle demanding tasks such as 3D rendering, machine learning, and software development with ease. The laptop comes with up to 128GB of unified memory and up to 8TB of SSD storage, ensuring that you have plenty of space and speed for all your projects. The MacBook Pro also features a redesigned Magic Keyboard with a more comfortable typing experience and an improved trackpad for precise control. Battery life is exceptional, with up to 21 hours of use on a single charge, allowing you to work all day without needing to plug in. The laptop also comes with Thunderbolt 4 ports, Wi-Fi 6E, and a high-fidelity audio system, making it a versatile tool for any professional. Whether you're a developer, designer, or content creator, the Apple MacBook Pro 16-inch is the ultimate machine for getting things done.",
        "productCategory": "Laptop",
        "productPrice": 3499,
        "brandName": "Apple",
        "productStoreDate": "2024-09-05",
        "productImg": "https://img.geniusdevsolutions.com/image/Apple%20MacBook%20Pro%2016-inch.webp",
        "productReview": 4.9
    },
    {
        "productName": "Logitech MX Master 3S",
        "productDescription": "The Logitech MX Master 3S is a premium wireless mouse designed for professionals who require precision, comfort, and customization in their work. This mouse features a unique ergonomic design that provides maximum comfort, even during extended periods of use. The MX Master 3S is equipped with Logitech's Darkfield high-precision sensor, which allows it to track on any surface, including glass, with up to 8000 DPI sensitivity. The mouse also features an advanced scroll wheel that provides precise and fast scrolling, making it perfect for navigating through long documents and web pages. The MX Master 3S comes with customizable buttons that can be programmed for specific tasks, allowing you to streamline your workflow and increase productivity. The mouse connects via Bluetooth or the included USB receiver, offering a stable and responsive connection. With a battery life of up to 70 days on a single charge, you won't have to worry about frequent recharging. The MX Master 3S also supports Logitech Flow, allowing you to control multiple computers with a single mouse, making it an ideal tool for multitaskers and professionals who work across different devices.",
        "productCategory": "Mouse",
        "productPrice": 99,
        "brandName": "Logitech",
        "productStoreDate": "2024-10-15",
        "productImg": "https://img.geniusdevsolutions.com/image/Logitech%20MX%20Master%203S.jpg",
        "productReview": 4.8
    },
    {
        "productName": "Samsung 49\" Odyssey Neo G9",
        "productDescription": "The Samsung 49\" Odyssey Neo G9 is a cutting-edge gaming monitor that redefines the gaming experience with its massive screen size, stunning visuals, and advanced features. This 49-inch curved monitor features a Dual Quad HD (DQHD) resolution of 5120x1440, providing an ultra-wide field of view that immerses you in your games like never before. The monitor's Quantum Mini LED technology delivers precise contrast and vibrant colors, while the 240Hz refresh rate and 1ms response time ensure smooth and responsive gameplay, even in fast-paced action scenes. The Odyssey Neo G9 also supports NVIDIA G-SYNC and AMD FreeSync Premium Pro, reducing screen tearing and stuttering for a more seamless gaming experience. The monitor's design is both futuristic and functional, with customizable RGB lighting on the back and an adjustable stand that allows you to find the perfect viewing angle. The Odyssey Neo G9 also features multiple connectivity options, including HDMI 2.1 and DisplayPort, making it compatible with the latest gaming consoles and PCs. Whether you're a competitive gamer or just love to immerse yourself in your favorite titles, the Samsung Odyssey Neo G9 is the ultimate monitor for an unparalleled gaming experience.",
        "productCategory": "Gaming Monitor",
        "productPrice": 2499,
        "brandName": "Samsung",
        "productStoreDate": "2024-11-01",
        "productImg": "https://img.geniusdevsolutions.com/image/Samsung%2049%20Odyssey%20Neo%20G9.webp",
        "productReview": 4.9
    },
    {
        "productName": "Apple Watch Series 9",
        "productDescription": "The Apple Watch Series 9 is the ultimate smartwatch, combining cutting-edge technology with elegant design to help you stay connected, active, and healthy. It features a larger and brighter always-on Retina display, making it easier to read notifications, messages, and fitness stats at a glance. The watch is powered by the new S9 chip, which provides faster performance and improved battery life, ensuring that you can rely on your watch throughout the day. With advanced health and fitness tracking capabilities, the Apple Watch Series 9 can monitor your heart rate, blood oxygen levels, and even perform an ECG. The watch also includes new workout modes, such as Pilates and Tai Chi, as well as improved sleep tracking to help you maintain a healthy lifestyle. The Series 9 is also water-resistant up to 50 meters, making it perfect for swimming and other water-based activities. Additionally, the watch supports cellular connectivity, allowing you to make calls, send messages, and stream music directly from your wrist without needing your iPhone. With a wide range of customizable watch faces and bands, the Apple Watch Series 9 can be personalized to suit your style and needs.",
        "productCategory": "Smartwatch",
        "productPrice": 499,
        "brandName": "Apple",
        "productStoreDate": "2024-01-20",
        "productImg": "https://img.geniusdevsolutions.com/image/Apple%20Watch%20Series%209",
        "productReview": 4.8
    },
    {
        "productName": "Sony A7 IV",
        "productDescription": "The Sony A7 IV is a versatile full-frame mirrorless camera designed for both photographers and videographers who demand top-notch performance. It features a 33MP Exmor R CMOS sensor and the latest BIONZ XR processor, which together deliver stunning image quality with incredible detail and dynamic range. The A7 IV is capable of shooting 4K video at up to 60fps, with full pixel readout and no pixel binning, ensuring that your videos are sharp and full of detail. The camera also features 5-axis in-body image stabilization, which provides up to 5.5 stops of shake correction, allowing you to shoot handheld with confidence, even in low light. The autofocus system is fast and accurate, with 759 phase-detection points covering nearly the entire frame, making it easy to track and capture fast-moving subjects. The A7 IV also offers real-time eye autofocus for both humans and animals, ensuring that your subjects are always in sharp focus. The camera's build quality is robust, with a weather-sealed magnesium alloy body that can withstand the rigors of professional use. With dual card slots, USB-C charging, and a high-resolution electronic viewfinder, the Sony A7 IV is a powerful and versatile tool for any creative professional.",
        "productCategory": "Camera",
        "productPrice": 2499,
        "brandName": "Sony",
        "productStoreDate": "2024-02-28",
        "productImg": "https://img.geniusdevsolutions.com/image/Sony%20A7%20IV.jpeg",
        "productReview": 4.9
    },
    {
        "productName": "HP Spectre x360 14",
        "productDescription": "The HP Spectre x360 14 is a premium 2-in-1 laptop that offers the perfect combination of performance, portability, and style. It features a stunning 13.5-inch OLED display with a 3:2 aspect ratio, providing more vertical screen space for productivity tasks and vibrant colors for media consumption. The Spectre x360 14 is powered by the latest Intel Core i7 processor and Intel Iris Xe graphics, delivering fast and efficient performance for all your computing needs. The laptop also comes with up to 16GB of RAM and 1TB of SSD storage, ensuring that you have plenty of space and speed for your files and applications. The Spectre x360 14's design is both sleek and durable, with a lightweight aluminum chassis and a gem-cut design that adds a touch of elegance. The laptop's 360-degree hinge allows you to use it in multiple modes, including laptop, tablet, tent, and stand, making it versatile enough to handle any task. The keyboard is backlit and comfortable to type on, and the touchpad is smooth and responsive. Battery life is impressive, offering up to 17 hours of use on a single charge, so you can stay productive all day. With Thunderbolt 4 ports, Wi-Fi 6, and advanced security features like a fingerprint reader and a webcam kill switch, the HP Spectre x360 14 is a powerful and secure laptop for work and play.",
        "productCategory": "Laptop",
        "productPrice": 1699,
        "brandName": "HP",
        "productStoreDate": "2024-03-15",
        "productImg": "https://img.geniusdevsolutions.com/image/HP%20Spectre%20x360%2014.jpeg",
        "productReview": 4.8
    },
    {
        "productName": "DJI Air 3",
        "productDescription": "The DJI Air 3 is a compact and powerful drone that is perfect for both beginners and experienced pilots. It features a 1-inch CMOS sensor that captures stunning 20MP photos and 5.4K video, providing incredible detail and clarity in your aerial footage. The Air 3's 3-axis gimbal ensures smooth and stable video, even in windy conditions, and the drone's advanced obstacle avoidance system helps you navigate safely through complex environments. The Air 3 also offers intelligent flight modes, such as ActiveTrack, which allows the drone to automatically follow and film a moving subject, and QuickShots, which makes it easy to capture cinematic shots with just a few taps. The drone's compact and foldable design makes it easy to carry with you wherever you go, and the included remote controller provides a stable and responsive connection, allowing you to fly with confidence. The Air 3 offers up to 34 minutes of flight time on a single charge, and with the DJI Fly app, you can easily edit and share your footage right from your smartphone. Whether you're capturing breathtaking landscapes, documenting your adventures, or just having fun, the DJI Air 3 is the perfect tool for aerial photography and videography.",
        "productCategory": "Drone",
        "productPrice": 999,
        "brandName": "DJI",
        "productStoreDate": "2024-04-25",
        "productImg": "https://img.geniusdevsolutions.com/image/DJI%20Air%203.webp",
        "productReview": 4.8
    },
    {
        "productName": "Fitbit Charge 6",
        "productDescription": "The Fitbit Charge 6 is a powerful and versatile fitness tracker that helps you stay on top of your health and fitness goals. It features a sleek and lightweight design with a bright OLED display that shows all your stats at a glance. The Charge 6 offers advanced fitness tracking capabilities, including heart rate monitoring, sleep tracking, and GPS tracking for outdoor activities like running and cycling. The tracker also includes new features such as stress management tools and an ECG app, which allows you to monitor your heart health right from your wrist. The Charge 6 is water-resistant up to 50 meters, making it perfect for swimming and other water-based activities. The battery life is impressive, offering up to 7 days of use on a single charge, so you can track your activities and workouts without worrying about frequent recharging. The Fitbit Charge 6 also integrates seamlessly with the Fitbit app, where you can view detailed insights, set goals, and track your progress over time. With its combination of advanced features, durable design, and long battery life, the Fitbit Charge 6 is an excellent choice for anyone looking to improve their fitness and overall health.",
        "productCategory": "Fitness Tracker",
        "productPrice": 179,
        "brandName": "Fitbit",
        "productStoreDate": "2024-05-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Fitbit%20Charge%206.jpg",
        "productReview": 4.7
    },
    {
        "productName": "Nest Learning Thermostat 4th Gen",
        "productDescription": "The Nest Learning Thermostat 4th Gen is a smart thermostat that helps you save energy and stay comfortable by learning your schedule and preferences over time. With its sleek design and high-resolution display, the Nest Thermostat looks great on your wall and is easy to use. The thermostat automatically adjusts the temperature when you're away, helping you save energy without sacrificing comfort. It also provides detailed energy reports so you can see how much energy you're using and find ways to reduce your consumption. The Nest Thermostat is compatible with most HVAC systems and can be controlled remotely via the Nest app, allowing you to adjust the temperature from anywhere using your smartphone. The thermostat also integrates with other smart home devices, such as Google Assistant and Amazon Alexa, making it easy to control your home's climate with just your voice. With its ability to learn and adapt to your lifestyle, the Nest Learning Thermostat 4th Gen is a smart investment for anyone looking to reduce their energy bills and create a more comfortable living environment.",
        "productCategory": "Smart Thermostat",
        "productPrice": 249,
        "brandName": "Nest",
        "productStoreDate": "2024-06-20",
        "productImg": "https://img.geniusdevsolutions.com/image/Nest%20Learning%20Thermostat%204th%20Gen.jpg",
        "productReview": 4.8
    },
    {
        "productName": "Nintendo Switch OLED Model",
        "productDescription": "The Nintendo Switch OLED Model is the latest iteration of the popular gaming console, featuring a vibrant 7-inch OLED display that provides richer colors and sharper contrast, making your games look better than ever. The OLED model also includes an improved kickstand that is wider and more stable, making it easier to play in tabletop mode. The console comes with 64GB of internal storage, giving you more space for your games and save data, and the enhanced audio provides a more immersive gaming experience whether you're playing on the go or docked to your TV. The Nintendo Switch OLED Model is compatible with all existing Switch games and accessories, and it offers the same versatile play modes as the original, allowing you to enjoy your games in handheld, tabletop, or TV mode. The console's Joy-Con controllers are detachable and can be used for multiplayer games, making it easy to play with friends and family. With its improved display, enhanced audio, and additional storage, the Nintendo Switch OLED Model is the perfect choice for both new and experienced gamers who want the best possible gaming experience.",
        "productCategory": "Gaming Console",
        "productPrice": 349,
        "brandName": "Nintendo",
        "productStoreDate": "2024-07-05",
        "productImg": "https://img.geniusdevsolutions.com/image/Nintendo%20Switch%20OLED%20Model.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Anker Soundcore Liberty 4",
        "productDescription": "The Anker Soundcore Liberty 4 are true wireless earbuds that deliver high-quality sound, long battery life, and a comfortable fit, making them an excellent choice for music lovers on the go. The earbuds feature dynamic drivers and support for aptX and AAC codecs, ensuring that your music sounds clear and detailed, with deep bass and crisp highs. The Liberty 4 also includes active noise cancellation (ANC) that blocks out ambient noise, allowing you to focus on your music or calls without distractions. The earbuds are lightweight and ergonomically designed, with multiple ear tips included to ensure a secure and comfortable fit for all-day wear. The battery life is impressive, with up to 9 hours of playtime on a single charge and an additional 31 hours provided by the charging case. The case itself is compact and easy to carry, and it supports wireless charging for added convenience. The Liberty 4 earbuds are also water-resistant, making them suitable for workouts and outdoor activities. With touch controls, voice assistant support, and a companion app for customization, the Anker Soundcore Liberty 4 offers a premium listening experience at an affordable price.",
        "productCategory": "True Wireless Earbuds",
        "productPrice": 129,
        "brandName": "Anker",
        "productStoreDate": "2024-08-12",
        "productImg": "https://img.geniusdevsolutions.com/image/Anker%20Soundcore%20Liberty%204.jpeg",
        "productReview": 4.7
    },
    {
        "productName": "iRobot Roomba i7+",
        "productDescription": "The iRobot Roomba i7+ is a smart robot vacuum that takes the hassle out of cleaning by automatically emptying its dustbin and learning your home's layout to provide a thorough and efficient cleaning experience. The Roomba i7+ uses advanced mapping technology to create a detailed map of your home, which it then uses to navigate around furniture and other obstacles, ensuring that every inch of your floors is cleaned. The vacuum's powerful suction and multi-surface rubber brushes work together to remove dirt, dust, and pet hair from both carpets and hard floors. The i7+ is also equipped with a high-efficiency filter that captures 99% of allergens, pollen, and dust particles, making it ideal for homes with pets or allergy sufferers. The vacuum can be controlled via the iRobot app, where you can schedule cleanings, set cleaning zones, and even customize your cleaning preferences. The Roomba i7+ automatically empties its dustbin into a Clean Base, which can hold up to 30 bins of debris, allowing you to go weeks without having to worry about vacuuming. With its smart features, powerful performance, and self-emptying capability, the iRobot Roomba i7+ is the perfect solution for keeping your home clean with minimal effort.",
        "productCategory": "Robot Vacuum",
        "productPrice": 899,
        "brandName": "iRobot",
        "productStoreDate": "2024-09-18",
        "productImg": "https://img.geniusdevsolutions.com/image/iRobot%20Roomba%20i7%2B.webp",
        "productReview": 4.8
    },
    {
        "productName": "Microsoft Surface Pro 9",
        "productDescription": "The Microsoft Surface Pro 9 is a versatile 2-in-1 device that combines the power of a laptop with the portability of a tablet, making it perfect for professionals and creatives alike. The Surface Pro 9 features a stunning 13-inch PixelSense touchscreen display with a resolution of 2880x1920, offering sharp and vibrant visuals that are perfect for design work, media consumption, and everyday tasks. The device is powered by the latest Intel Core i7 processor and comes with up to 32GB of RAM and 1TB of SSD storage, ensuring that you have the performance and space you need for all your applications and files. The Surface Pro 9 also includes an improved detachable keyboard and a responsive Surface Pen, making it easy to switch between laptop and tablet mode for a seamless workflow. The device offers up to 15 hours of battery life on a single charge, allowing you to work all day without needing to plug in. With its lightweight design, high-resolution display, and powerful internals, the Microsoft Surface Pro 9 is the ideal device for anyone who needs a flexible and powerful computing solution.",
        "productCategory": "2-in-1 Laptop",
        "productPrice": 1999,
        "brandName": "Microsoft",
        "productStoreDate": "2024-10-03",
        "productImg": "https://img.geniusdevsolutions.com/image/Microsoft%20Surface%20Pro%209.webp",
        "productReview": 4.9
    },
    {
        "productName": "Samsung Galaxy Z Fold 5",
        "productDescription": "The Samsung Galaxy Z Fold 5 is a groundbreaking foldable smartphone that offers the best of both worlds: the portability of a smartphone and the versatility of a tablet. The Galaxy Z Fold 5 features a 7.6-inch Dynamic AMOLED 2X main display that unfolds to reveal a large, immersive screen, perfect for multitasking, gaming, and watching videos. The cover display is a 6.2-inch Super AMOLED screen that provides easy access to your apps and notifications when the phone is folded. The Galaxy Z Fold 5 is powered by the latest Snapdragon processor and comes with up to 12GB of RAM and 512GB of storage, ensuring smooth performance and ample space for your apps, games, and media. The phone's design is both sleek and durable, with an improved hinge mechanism that makes it easier to fold and unfold the device. The Galaxy Z Fold 5 also includes a versatile camera system, with a 108MP main sensor, a 12MP ultra-wide lens, and a 12MP telephoto lens, allowing you to capture stunning photos and videos in any situation. The phone supports 5G connectivity, providing fast and reliable internet speeds, and the large battery ensures that you can stay connected all day. With its innovative design, powerful performance, and advanced features, the Samsung Galaxy Z Fold 5 is the ultimate device for anyone who wants a cutting-edge smartphone experience.",
        "productCategory": "Smartphone",
        "productPrice": 1999,
        "brandName": "Samsung",
        "productStoreDate": "2024-12-01",
        "productImg": "https://img.geniusdevsolutions.com/image/Samsung%20Galaxy%20Z%20Fold%205.webp",
        "productReview": 4.9
    },
    {
        "productName": "Breville Barista Pro",
        "productDescription": "The Breville Barista Pro is a premium espresso machine that brings the café experience to your home, allowing you to brew delicious espresso and other coffee drinks with ease. The Barista Pro features a built-in conical burr grinder with dose control, ensuring that you get the perfect amount of freshly ground coffee for every shot. The machine also includes a ThermoJet heating system, which heats up in just 3 seconds, allowing you to start brewing almost instantly. The Barista Pro's intuitive interface makes it easy to control the grind size, shot volume, and milk frothing settings, giving you complete control over your coffee-making process. The machine also includes a powerful steam wand, which allows you to create velvety microfoam for lattes and cappuccinos. The Barista Pro's design is sleek and durable, with a brushed stainless steel finish that looks great in any kitchen. The machine's large water tank and drip tray make it easy to brew multiple drinks without needing to refill or clean, and the included accessories, such as the tamper and milk jug, ensure that you have everything you need to get started. Whether you're a coffee connoisseur or just looking to upgrade your morning routine, the Breville Barista Pro is the perfect choice for anyone who loves great coffee.",
        "productCategory": "Espresso Machine",
        "productPrice": 799,
        "brandName": "Breville",
        "productStoreDate": "2024-12-15",
        "productImg": "https://img.geniusdevsolutions.com/image/Breville%20Barista%20Pro.webp",
        "productReview": 4.8
    },
    {
        "productName": "Dyson V12 Detect Slim",
        "productDescription": "The Dyson V12 Detect Slim is a cutting-edge cordless vacuum cleaner that combines powerful suction with innovative laser technology to help you achieve a deeper clean. The vacuum features a laser that reveals microscopic dust particles on hard floors, making it easy to see and remove even the smallest debris. The V12 Detect Slim is equipped with Dyson's Hyperdymium motor, which delivers powerful suction to capture dirt, dust, and allergens from all floor types. The vacuum's advanced filtration system captures 99.99% of particles as small as 0.3 microns, ensuring that the air in your home is cleaner and healthier. The vacuum is lightweight and easy to maneuver, making it ideal for cleaning both floors and above-floor surfaces. The V12 Detect Slim also includes a range of attachments, such as a crevice tool, combination tool, and mini motorized tool, allowing you to clean every corner of your home with ease. The vacuum's LCD screen displays real-time performance data, including battery life and maintenance alerts, so you can keep your vacuum running at its best. With up to 60 minutes of runtime on a single charge and a convenient wall-mounted docking station, the Dyson V12 Detect Slim is the perfect solution for effortless, whole-home cleaning.",
        "productCategory": "Cordless Vacuum",
        "productPrice": 599,
        "brandName": "Dyson",
        "productStoreDate": "2024-02-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Dyson%20V12%20Detect%20Slim.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Apple MacBook Air M3",
        "productDescription": "The Apple MacBook Air M3 is a sleek and powerful laptop designed for users who need both performance and portability. Powered by Apple's M3 chip, the MacBook Air delivers blazing-fast speed and efficiency, making it perfect for everything from everyday tasks to professional-grade work. The laptop features a stunning 13.6-inch Retina display with True Tone technology, providing sharp and vibrant visuals that are easy on the eyes. With up to 16GB of unified memory and up to 2TB of SSD storage, the MacBook Air can handle multiple applications and large files with ease. The laptop's fanless design ensures quiet operation, and its lightweight aluminum body makes it easy to carry with you wherever you go. The MacBook Air M3 also offers up to 20 hours of battery life on a single charge, so you can work or play all day without needing to plug in. The laptop includes a Magic Keyboard with a refined scissor mechanism for a comfortable typing experience, and the Force Touch trackpad provides precise control and navigation. With its combination of power, portability, and premium design, the Apple MacBook Air M3 is the perfect choice for students, professionals, and creatives alike.",
        "productCategory": "Laptop",
        "productPrice": 1299,
        "brandName": "Apple",
        "productStoreDate": "2024-03-01",
        "productImg": "https://img.geniusdevsolutions.com/image/Apple%20MacBook%20Air%20M3.webp",
        "productReview": 4.8
    },
    {
        "productName": "Canon EOS R6 Mark II",
        "productDescription": "The Canon EOS R6 Mark II is a full-frame mirrorless camera that delivers exceptional image quality and performance for both photography and videography. The camera is equipped with a 24.1-megapixel CMOS sensor and Canon's latest DIGIC X processor, providing stunning detail, accurate colors, and low noise even in challenging lighting conditions. The EOS R6 Mark II features an advanced autofocus system with Dual Pixel CMOS AF II, which offers fast and precise focusing, even in low light. The camera also includes in-body image stabilization, which compensates for camera shake and allows you to shoot sharp images at slower shutter speeds. For videographers, the EOS R6 Mark II offers 4K video recording at up to 60fps, with the option to shoot in 10-bit 4:2:2 for enhanced color grading flexibility. The camera's compact and weather-sealed body makes it ideal for shooting in a variety of environments, and its intuitive controls and touchscreen interface make it easy to use. With its powerful features and versatile performance, the Canon EOS R6 Mark II is the perfect choice for photographers and videographers who demand the best.",
        "productCategory": "Mirrorless Camera",
        "productPrice": 2499,
        "brandName": "Canon",
        "productStoreDate": "2024-04-18",
        "productImg": "https://img.geniusdevsolutions.com/image/Canon%20EOS%20R6%20Mark%20II.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Bose QuietComfort 45",
        "productDescription": "The Bose QuietComfort 45 are over-ear wireless headphones that combine legendary noise cancellation with superior sound quality and comfort. The headphones feature Bose's Acoustic Noise Cancelling technology, which uses microphones both inside and outside the earcups to monitor and cancel out ambient noise, allowing you to enjoy your music or calls in peace. The QuietComfort 45 delivers balanced audio performance with deep bass and clear highs, making your music sound rich and immersive. The headphones are lightweight and ergonomically designed, with plush ear cushions and a padded headband that ensure a comfortable fit for long listening sessions. The battery life is impressive, offering up to 24 hours of playtime on a single charge, and the headphones also support quick charging, providing 3 hours of use from just a 15-minute charge. The QuietComfort 45 includes touch controls for easy playback and volume adjustment, as well as support for voice assistants like Google Assistant and Amazon Alexa. With its combination of best-in-class noise cancellation, excellent sound quality, and long battery life, the Bose QuietComfort 45 is the ultimate choice for anyone who values a premium audio experience.",
        "productCategory": "Wireless Headphones",
        "productPrice": 329,
        "brandName": "Bose",
        "productStoreDate": "2024-05-05",
        "productImg": "https://img.geniusdevsolutions.com/image/Bose%20QuietComfort%2045.webp",
        "productReview": 4.8
    },
    {
        "productName": "LG OLED C2",
        "productDescription": "The LG OLED C2 is a premium 4K smart TV that delivers stunning picture quality and advanced features, making it perfect for movie lovers and gamers alike. The TV features a 65-inch OLED display with self-lighting pixels that provide perfect blacks, infinite contrast, and vibrant colors, creating a truly immersive viewing experience. The OLED C2 supports Dolby Vision IQ and HDR10, ensuring that your content looks its best with enhanced brightness and color accuracy. The TV is powered by LG's α9 Gen 5 AI Processor, which optimizes picture and sound quality based on the content you're watching and the ambient lighting in your room. The OLED C2 also includes advanced gaming features, such as NVIDIA G-SYNC compatibility, a 120Hz refresh rate, and low input lag, making it an excellent choice for gamers who want a competitive edge. The TV runs on LG's webOS platform, which offers access to a wide range of streaming apps and services, as well as voice control through Google Assistant and Amazon Alexa. With its sleek design, outstanding picture quality, and smart features, the LG OLED C2 is the perfect addition to any home entertainment setup.",
        "productCategory": "Smart TV",
        "productPrice": 1799,
        "brandName": "LG",
        "productStoreDate": "2024-06-10",
        "productImg": "https://img.geniusdevsolutions.com/image/LG%20OLED%20C2.webp",
        "productReview": 4.9
    },
    {
        "productName": "GoPro Hero12 Black",
        "productDescription": "The GoPro Hero12 Black is a rugged and versatile action camera that lets you capture stunning videos and photos in the most extreme conditions. The camera features a 23.6-megapixel sensor that delivers sharp and detailed images, as well as 5.3K video recording at up to 60fps, ensuring that your footage looks smooth and cinematic. The Hero12 Black includes HyperSmooth 4.0 stabilization, which provides gimbal-like stability, even in the most intense action scenes. The camera is waterproof up to 33 feet without a housing, making it perfect for capturing underwater adventures. The Hero12 Black also includes a range of creative features, such as TimeWarp 3.0, which lets you capture stabilized time-lapse videos, and SuperPhoto, which automatically enhances your photos with HDR. The camera's rugged design is built to withstand drops, shocks, and extreme temperatures, so you can take it with you on any adventure. The Hero12 Black is also compatible with a wide range of GoPro accessories, allowing you to mount it on helmets, bikes, and more. With its powerful features and durable design, the GoPro Hero12 Black is the ultimate action camera for capturing your most epic moments.",
        "productCategory": "Action Camera",
        "productPrice": 499,
        "brandName": "GoPro",
        "productStoreDate": "2024-07-22",
        "productImg": "https://img.geniusdevsolutions.com/image/GoPro%20Hero12%20Black.jpg",
        "productReview": 4.8
    },
    {
        "productName": "Samsung Galaxy Tab S9+",
        "productDescription": "The Samsung Galaxy Tab S9+ is a premium Android tablet that offers a stunning display, powerful performance, and versatile features, making it perfect for both work and play. The tablet features a 12.4-inch Super AMOLED display with a 120Hz refresh rate, providing smooth and vibrant visuals that are perfect for watching movies, playing games, and browsing the web. The Galaxy Tab S9+ is powered by the latest Snapdragon processor and comes with up to 8GB of RAM and 256GB of storage, ensuring smooth multitasking and ample space for your apps and media. The tablet also includes an advanced S Pen, which offers precise control and a natural writing experience, making it ideal for taking notes, drawing, and editing documents. The Galaxy Tab S9+ supports 5G connectivity, providing fast and reliable internet speeds, and the large battery ensures that you can stay connected all day. The tablet's sleek design is both lightweight and durable, with an aluminum frame that feels premium in hand. The Galaxy Tab S9+ also includes a versatile camera system, with a 13MP main sensor and an 8MP front camera, allowing you to capture high-quality photos and videos. With its powerful features and elegant design, the Samsung Galaxy Tab S9+ is the ultimate tablet for productivity and entertainment.",
        "productCategory": "Tablet",
        "productPrice": 999,
        "brandName": "Samsung",
        "productStoreDate": "2024-08-15",
        "productImg": "https://img.geniusdevsolutions.com/image/Samsung%20Galaxy%20Tab%20S9%2B.webp",
        "productReview": 4.8
    },
    {
        "productName": "Sony PlayStation 5 Pro",
        "productDescription": "The Sony PlayStation 5 Pro is the ultimate gaming console, offering cutting-edge performance and immersive gaming experiences. The PS5 Pro features a custom AMD Ryzen processor and RDNA 3 GPU, delivering breathtaking graphics and lightning-fast load times for your favorite games. The console supports 4K gaming at up to 120fps, with ray tracing and HDR technology providing realistic lighting and stunning visuals. The PS5 Pro also includes a high-speed SSD, which significantly reduces loading times and allows you to jump into games faster than ever before. The console's Tempest 3D AudioTech delivers immersive soundscapes, making you feel like you're right in the middle of the action. The PS5 Pro's sleek and modern design is both stylish and functional, with a built-in cooling system that ensures optimal performance during extended gaming sessions. The console is compatible with a wide range of PlayStation games and accessories, and it includes a new DualSense controller with haptic feedback and adaptive triggers, providing a more tactile and responsive gaming experience. With its powerful hardware, innovative features, and extensive game library, the Sony PlayStation 5 Pro is the ultimate choice for gamers who demand the best.",
        "productCategory": "Gaming Console",
        "productPrice": 699,
        "brandName": "Sony",
        "productStoreDate": "2024-09-03",
        "productImg": "https://img.geniusdevsolutions.com/image/Sony%20PlayStation%205%20Pro.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Nikon Z8",
        "productDescription": "The Nikon Z8 is a high-performance mirrorless camera designed for professional photographers and serious enthusiasts who demand the best. The camera features a 45.7-megapixel full-frame sensor, which delivers stunning image quality with exceptional detail, dynamic range, and low noise. The Z8 is powered by Nikon's latest EXPEED 7 processor, providing fast and responsive performance for both stills and video. The camera's advanced autofocus system includes 493 focus points with Eye-Detection and Animal-Detection AF, ensuring that your subjects are always in sharp focus, even in challenging conditions. The Z8 also includes in-body image stabilization, which compensates for camera shake and allows you to shoot sharp images at slower shutter speeds. For videographers, the Z8 offers 8K video recording at up to 30fps, as well as 4K recording at up to 120fps for slow-motion capture. The camera's rugged and weather-sealed body is built to withstand the demands of professional use, and its intuitive controls and tilting touchscreen make it easy to use in any shooting situation. With its powerful features, versatile performance, and robust build, the Nikon Z8 is the ultimate tool for capturing stunning photos and videos.",
        "productCategory": "Mirrorless Camera",
        "productPrice": 3499,
        "brandName": "Nikon",
        "productStoreDate": "2024-10-12",
        "productImg": "https://img.geniusdevsolutions.com/image/Nikon%20Z8.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Bose QuietComfort 55",
        "productDescription": "The Bose QuietComfort 55 headphones are the ultimate choice for anyone who values high-quality audio and comfort. The QC 55 features Bose's world-renowned noise-canceling technology, which blocks out unwanted noise and lets you focus on your music, podcasts, or calls. The headphones are equipped with custom-tuned drivers that deliver rich, balanced sound with deep bass and clear highs, making them perfect for all types of music. The QC 55 includes a comfortable and lightweight design, with plush ear cushions and an adjustable headband that ensures a perfect fit for long listening sessions. The headphones also offer up to 30 hours of battery life on a single charge, so you can enjoy your music all day without needing to recharge. The QC 55 supports Bluetooth 5.2 for a stable and reliable wireless connection, and it includes a built-in microphone for clear and crisp call quality. The headphones also support voice assistants like Siri and Google Assistant, allowing you to control your music and manage your day with just your voice. With its premium build quality, superior sound, and industry-leading noise cancellation, the Bose QuietComfort 55 headphones are the perfect companion for anyone who wants to enjoy their music without distractions.",
        "productCategory": "Headphones",
        "productPrice": 399,
        "brandName": "Bose",
        "productStoreDate": "2024-10-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Bose%20QuietComfort%2055.png",
        "productReview": 4.9
    },
    {
        "productName": "Lenovo ThinkPad X1 Carbon Gen 10",
        "productDescription": "The Lenovo ThinkPad X1 Carbon Gen 10 is a premium business laptop that combines durability, performance, and portability. Featuring a 14-inch WUXGA display with a narrow bezel design, the X1 Carbon provides crisp and vibrant visuals that are perfect for professional use. The laptop is powered by Intel's 12th Gen Core i7 or i9 processors and can be configured with up to 64GB of RAM and 2TB of SSD storage, ensuring fast and efficient performance for multitasking and demanding applications. The ThinkPad X1 Carbon is known for its rugged build quality, with a carbon-fiber reinforced chassis that meets MIL-STD 810H standards for durability. The laptop includes a backlit keyboard with a responsive typing experience and a large precision touchpad for easy navigation. It also offers a variety of connectivity options, including Thunderbolt 4, USB-C, and an HDMI port, making it versatile for different work environments. With up to 15 hours of battery life and rapid charging capabilities, the Lenovo ThinkPad X1 Carbon Gen 10 is an excellent choice for professionals who need a reliable and high-performing laptop on the go.",
        "productCategory": "Business Laptop",
        "productPrice": 2399,
        "brandName": "Lenovo",
        "productStoreDate": "2024-05-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Lenovo%20ThinkPad%20X1%20Carbon%20Gen%2010.webp",
        "productReview": 4.8
    },
    {
        "productName": "GoPro Hero10 Black",
        "productDescription": "The GoPro Hero10 Black is an action camera designed to capture high-quality footage in the most demanding environments. Featuring a 23MP sensor and a powerful GP2 processor, the Hero10 Black offers stunning 5.3K video recording at 60fps, along with 4K video at 120fps for ultra-smooth slow-motion capture. The camera's HyperSmooth 4.0 stabilization ensures that your footage remains steady and smooth, even during intense action. The Hero10 Black is built to withstand harsh conditions, with a waterproof design that can handle depths of up to 33 feet without the need for additional housing. It also includes a range of intelligent shooting modes, such as TimeWarp 3.0 for stabilized time-lapse videos and SuperPhoto for automatic HDR enhancement. The camera features a front LCD screen for easy framing of selfies and a rear touchscreen for intuitive controls and settings adjustments. With a long-lasting battery that provides up to 2.5 hours of recording time and built-in Wi-Fi for easy file transfers, the GoPro Hero10 Black is the perfect tool for capturing your most exciting adventures.",
        "productCategory": "Action Camera",
        "productPrice": 399,
        "brandName": "GoPro",
        "productStoreDate": "2024-06-25",
        "productImg": "https://img.geniusdevsolutions.com/image/GoPro%20Hero10%20Black.webp",
        "productReview": 4.8
    },
    {
        "productName": "Apple iPad Pro 12.9\" (2024)",
        "productDescription": "The Apple iPad Pro 12.9\" (2024) is a powerful and versatile tablet designed for creative professionals and power users. Featuring a 12.9-inch Liquid Retina XDR display with ProMotion technology and a resolution of 2732 x 2048, the iPad Pro delivers exceptional color accuracy, brightness, and responsiveness for a truly immersive viewing experience. The tablet is powered by Apple's M3 chip, which offers blazing-fast performance for demanding tasks such as graphic design, video editing, and gaming. The iPad Pro includes up to 16GB of RAM and up to 2TB of storage, providing ample space for your files, apps, and projects. The tablet also supports the 2nd generation Apple Pencil and the Magic Keyboard, allowing you to use it for drawing, note-taking, and typing with precision. The iPad Pro features a dual-camera system with a 12MP wide lens and a 10MP ultra-wide lens, as well as a LiDAR scanner for enhanced augmented reality experiences. With its advanced performance, stunning display, and extensive accessory support, the Apple iPad Pro 12.9\" (2024) is the ultimate tablet for professionals and creatives.",
        "productCategory": "Tablet",
        "productPrice": 1299,
        "brandName": "Apple",
        "productStoreDate": "2024-08-05",
        "productImg": "https://img.geniusdevsolutions.com/image/Apple%20iPad%20Pro%2012.9.jpg",
        "productReview": 4.9
    },
    {
        "productName": "Sony A7R V",
        "productDescription": "The Sony A7R V is a high-resolution full-frame mirrorless camera designed for professional photographers and enthusiasts who demand exceptional image quality and performance. Featuring a 61MP Exmor R CMOS sensor and BIONZ XR image processor, the A7R V delivers stunningly detailed and vibrant images with impressive dynamic range and low noise. The camera includes a 5-axis in-body image stabilization system, which helps reduce camera shake and allows for sharper images at slower shutter speeds. The A7R V's advanced autofocus system boasts 759 phase-detection points and 425 contrast-detection points, ensuring fast and accurate focusing on your subjects. The camera supports 8K video recording at up to 10fps, as well as 4K video at up to 60fps, providing high-quality video capabilities for professional use. The A7R V features a high-resolution 9.44 million-dot OLED electronic viewfinder and a 3.2-inch LCD touchscreen, offering excellent visibility and intuitive controls. With its robust build quality, weather-sealed design, and powerful features, the Sony A7R V is the ideal camera for capturing breathtaking photos and videos in any condition.",
        "productCategory": "Mirrorless Camera",
        "productPrice": 3899,
        "brandName": "Sony",
        "productStoreDate": "2024-11-20",
        "productImg": "https://img.geniusdevsolutions.com/image/Sony%20A7R%20V.webp",
        "productReview": 4.9
    },
    {
        "productName": "Epson EcoTank ET-2850",
        "productDescription": "The Epson EcoTank ET-2850 is an efficient and cost-effective all-in-one printer that is perfect for home or small office use. This printer features Epson's innovative EcoTank technology, which eliminates the need for traditional ink cartridges and reduces printing costs. Instead, it uses high-capacity ink tanks that are easy to refill and can print thousands of pages before needing a refill. The ET-2850 offers high-quality color printing with a resolution of up to 5760 x 1440 dpi, ensuring sharp and vibrant prints for documents and photos. It includes wireless connectivity options such as Wi-Fi and Bluetooth, allowing you to print directly from your smartphone or tablet using the Epson Smart Panel app. The printer also supports automatic two-sided printing, helping you save on paper and reduce waste. With its compact design and high-capacity ink system, the Epson EcoTank ET-2850 is an excellent choice for users looking for an affordable and environmentally friendly printing solution.",
        "productCategory": "Printer",
        "productPrice": 249,
        "brandName": "Epson",
        "productStoreDate": "2024-11-10",
        "productImg": "https://img.geniusdevsolutions.com/image/Epson%20EcoTank%20ET-2850.jpg",
        "productReview": 4.6
    },
    {
        "productName": "HP Omen 17",
        "productDescription": "The HP Omen 17 is a powerful gaming laptop designed to deliver an immersive and high-performance gaming experience. It features a large 17.3-inch display with a resolution of up to 4K UHD and a high refresh rate of up to 144Hz, ensuring smooth and stunning visuals for your favorite games. Powered by the latest Intel Core i7 or i9 processors and NVIDIA GeForce RTX 4070 graphics, the Omen 17 offers exceptional performance for gaming, streaming, and content creation. The laptop comes with up to 32GB of RAM and 1TB of SSD storage, providing ample space and speed for all your games and applications. The Omen 17 includes advanced cooling technology to keep the system running at optimal temperatures during intense gaming sessions. Its customizable RGB backlit keyboard and sleek design add a touch of style to its powerful performance. With its high-end hardware, large display, and advanced features, the HP Omen 17 is the ultimate choice for gamers who demand the best.",
        "productCategory": "Gaming Laptop",
        "productPrice": 2199,
        "brandName": "HP",
        "productStoreDate": "2024-10-05",
        "productImg": "https://img.geniusdevsolutions.com/image/HP%20Omen%2017.webp",
        "productReview": 4.8
    },
    {
        "productName": "Samsung Galaxy Watch 6",
        "productDescription": "The Samsung Galaxy Watch 6 is a feature-rich smartwatch that combines advanced health tracking with a stylish design. The watch features a bright and vibrant AMOLED display, making it easy to view your stats, notifications, and apps even in direct sunlight. Equipped with Samsung's latest Exynos W920 processor, the Galaxy Watch 6 offers smooth performance and responsiveness for all your smartwatch needs. It includes comprehensive health and fitness tracking features, such as heart rate monitoring, ECG, blood oxygen levels, and advanced sleep tracking, providing you with detailed insights into your well-being. The watch also supports GPS for accurate location tracking during outdoor activities and offers a variety of workout modes to suit different fitness routines. With its water resistance up to 50 meters and a battery life of up to 40 hours, the Galaxy Watch 6 is perfect for both daily wear and intense workouts. It also integrates seamlessly with Samsung's ecosystem, allowing you to control smart home devices and receive notifications right from your wrist.",
        "productCategory": "Smartwatch",
        "productPrice": 349,
        "brandName": "Samsung",
        "productStoreDate": "2024-07-01",
        "productImg": "https://img.geniusdevsolutions.com/image/Samsung%20Galaxy%20Watch%206.jpg",
        "productReview": 4.8
    }
]